; domain
;; Source: https://github.com/josej30/Planner-Sat-Constraints

(define (domain logistics)

(:requirements :strips :typing) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location ?c - city)
         :precondition  (and (at ?t ?from)
                             (in-city ?from ?c)
                             (in-city ?to ?c))
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_logistics_1)

(:domain logistics)

(:objects
	obj0 obj2 obj5 - airport
	obj1 obj3 obj6 - city
	obj4 obj8 obj11 - truck
	obj7 obj10 obj12 obj13 obj15 obj16 obj17 - package
	obj9 obj14 - airplane
)

(:init
	(at obj7 obj0)
	(at obj14 obj5)
	(at obj9 obj5)
	(in-city obj2 obj3)
	(at obj17 obj5)
	(at obj13 obj5)
	(in-city obj5 obj6)
	(in-city obj0 obj1)
	(at obj10 obj0)
	(at obj16 obj2)
	(at obj8 obj5)
	(at obj12 obj2)
	(at obj4 obj2)
	(at obj15 obj5)
	(at obj11 obj0)
)

(:goal (and
	(at obj15 obj0)
	(at obj17 obj0)
	(at obj10 obj2)
	(at obj12 obj5)
	(at obj13 obj2)
	(at obj16 obj0)
	(at obj7 obj5)
))
)

; plan
1. (load obj9 obj17 obj5)
   deleted: (at obj17 obj5)
   added: (in obj17 obj9)
   goals met: 0 of 7
2. (load obj9 obj15 obj5)
   deleted: (at obj15 obj5)
   added: (in obj15 obj9)
   goals met: 0 of 7
3. (fly obj9 obj5 obj0)
   deleted: (at obj9 obj5)
   added: (at obj9 obj0)
   goals met: 0 of 7
4. (load obj9 obj7 obj0)
   deleted: (at obj7 obj0)
   added: (in obj7 obj9)
   goals met: 0 of 7
5. (unload obj9 obj17 obj0)
   deleted: (in obj17 obj9)
   added: (at obj17 obj0)
   goals met: 1 of 7
6. (unload obj9 obj15 obj0)
   deleted: (in obj15 obj9)
   added: (at obj15 obj0)
   goals met: 2 of 7
7. (load obj9 obj10 obj0)
   deleted: (at obj10 obj0)
   added: (in obj10 obj9)
   goals met: 2 of 7
8. (load obj14 obj13 obj5)
   deleted: (at obj13 obj5)
   added: (in obj13 obj14)
   goals met: 2 of 7
9. (fly obj14 obj5 obj2)
   deleted: (at obj14 obj5)
   added: (at obj14 obj2)
   goals met: 2 of 7
10. (fly obj9 obj0 obj2)
   deleted: (at obj9 obj0)
   added: (at obj9 obj2)
   goals met: 2 of 7
11. (load obj9 obj16 obj2)
   deleted: (at obj16 obj2)
   added: (in obj16 obj9)
   goals met: 2 of 7
12. (fly obj9 obj2 obj0)
   deleted: (at obj9 obj2)
   added: (at obj9 obj0)
   goals met: 2 of 7
13. (unload obj9 obj16 obj0)
   deleted: (in obj16 obj9)
   added: (at obj16 obj0)
   goals met: 3 of 7
14. (fly obj9 obj0 obj2)
   deleted: (at obj9 obj0)
   added: (at obj9 obj2)
   goals met: 3 of 7
15. (load obj9 obj12 obj2)
   deleted: (at obj12 obj2)
   added: (in obj12 obj9)
   goals met: 3 of 7
16. (unload obj9 obj10 obj2)
   deleted: (in obj10 obj9)
   added: (at obj10 obj2)
   goals met: 4 of 7
17. (fly obj9 obj2 obj5)
   deleted: (at obj9 obj2)
   added: (at obj9 obj5)
   goals met: 4 of 7
18. (unload obj9 obj7 obj5)
   deleted: (in obj7 obj9)
   added: (at obj7 obj5)
   goals met: 5 of 7
19. (unload obj9 obj12 obj5)
   deleted: (in obj12 obj9)
   added: (at obj12 obj5)
   goals met: 6 of 7
20. (unload obj14 obj13 obj2)
   deleted: (in obj13 obj14)
   added: (at obj13 obj2)
   goals met: 7 of 7
